<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.2" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <!-- Component name -->
      <string id="Cat_FileShareShadowCopyAgent">File Share Shadow Copy Agent</string>
      <!-- Component name -->

       <string id="Pol_MaximumAge">Configure maximum age of file server shadow copies</string>
       <string id="Pol_MaximumAge_Help">This policy setting configures the maximum age of a file share shadow copy. File share shadow copies that are older than this age will be deleted by the File Share Shadow Copy Agent. Both the exposed shadow copy share and the corresponding volume shadow copy will be deleted.

If you enable this policy setting, the value specified determines the maximum age of a file share shadow copy.

If you disable or do not configure this policy setting, file share shadow copies older than 24 hours will be deleted.

       </string>
     </stringTable>
     <presentationTable> 
       <presentation id="Pol_MaximumAge">
         <decimalTextBox refId="Lbl_MaximumShadowCopyAgeInHours" defaultValue="24" spinStep="1">Maximum Age of Shadow Copies to be Garbage Collected in Hours: </decimalTextBox>
       </presentation> 
    </presentationTable>
   </resources>
</policyDefinitionResources>
